In [1]:
import pandas as pd
new = 'tables_dataset.csv'

In [13]:
newdf = pd.read_csv(new)

In [16]:
newdf

,DocID,TableNum,Columns,Class,TagMethod
0,593,1,"['RIVERS ', 'INNER ', 'by ', 'G. ', 'Rose. ']",0.0,manual
1,593,2,"['Adamson, C.L. ', 'Geological Report on the P...",0.0,manual
2,1229,1,"['Bendaaticeras ', 'flindersi ', 'Cephineceras...",0.0,manual
3,1229,2,"['Laing, ', 'A.C.M. ', 'and Powr, P.L. 1960. C...",0.0,manual
4,2646,1,"['Page ', 'OBJECTIVES ', 'DRILLING ', 'GEOLOGY...",0.0,manual
...,...,...,...,...,...
11484,63981,175,"['Zone Name ', 'TVD at (m) ', 'Bottom MD (m) '...",0.0,manual
11485,63981,176,"['Zone Name ', 'TVD Bottom (m) ', 'at MD Botto...",0.0,manual
11486,37807,15,"['zsst ', 'fine to vf grn, light grey, feld li...",0.0,manual
11487,37807,17,"['zsst ', 'tending to Zst IB 50% fine, light g...",0.0,manual
11488,67547,210,"['Zt ', 'Et ', 'Et ', 'tt ', 'Et ', 'Et ', 'IS...",0.0,manual

In [15]:
newdf.loc[newdf['Class'] == newdf['Class'], 'TagMethod'] = 'manual'

In [18]:
newdf.to_csv(new, index=False)

In [68]:
#data.apply(lambda x: x.Columns_x == x.Columns_y )
data['Columns_x'].loc[(data['Columns_y'] == data['Columns_y'] ) & (data['Columns_x'] != data['Columns_y'])] = data['Columns_y']

In [55]:
data['Columns_x'].loc[(data['Columns_y'] == data['Columns_y'] ) & (data['Columns_x'] != data['Columns_y'])]

1048575    NaN
1048576    NaN
1048577    NaN
1048578    NaN
1048579    NaN
          ...
1056536    NaN
1056537    NaN
1056538    NaN
1056539    NaN
1056540    NaN
Name: Columns_x, Length: 7966, dtype: object

In [70]:
data['Columns'] = data['Columns_x']
data = data.drop(['Columns_x', 'Columns_y'], axis=1)

In [72]:
data.dropna(subset=['Columns'])

,DocID,TableNum,Class,TagMethod,Columns
0,593.0,1.0,0.0,manual,"['RIVERS ', 'INNER ', 'by ', 'G. ', 'Rose. ']"
1,593.0,2.0,0.0,manual,"['Adamson, C.L. ', 'Geological Report on the P..."
2,1229.0,1.0,0.0,manual,"['Bendaaticeras ', 'flindersi ', 'Cephineceras..."
3,1229.0,2.0,0.0,manual,"['Laing, ', 'A.C.M. ', 'and Powr, P.L. 1960. C..."
4,2646.0,1.0,0.0,manual,"['Page ', 'OBJECTIVES ', 'DRILLING ', 'GEOLOGY..."
...,...,...,...,...,...
1056536,99683.0,5.0,NaN,NaN,"['BIM ', 'Block ', 'Sub-blocks ', 'Clon ', 'e ..."
1056537,99683.0,6.0,NaN,NaN,"['Hole Id ', 'East MGA94 ', 'North MGA94 ', 'A..."
1056538,99683.0,7.0,NaN,NaN,"['O ', 'ECP001 ECR0003 ', 'O ', 'ANP05 ECR0002..."
1056539,99683.0,8.0,NaN,NaN,"['Hole ID ', 'Easting MGA54 ', 'Northing MGA54..."
1056540,99683.0,9.0,NaN,NaN,"['O ', 'ECP001 ECR0003 ', 'O ', 'ANP05 ECR0002..."

In [74]:
data = data.dropna(subset=['Columns'])

In [65]:
data.loc[data['Columns_y'] != data['Columns_y']]

,DocID,TableNum,Columns_x,Class,TagMethod,Columns_y
828,42688.0,1.0,"['Tipperary WELL COMPLETION REPORT ', 'Santos ...",NaN,auto,NaN
829,42688.0,2.0,"['AGE ', 'FORMATION ', 'R.T. DEPTHS (m) ', 'MS...",NaN,auto,NaN
830,42688.0,3.0,"['Coal ', 'Top (m RT) ', 'Base (m RT) ', 'Gros...",NaN,auto,NaN
831,42688.0,4.0,"['Location: ', 'Latitude: ', 'Status: ', 'Case...",NaN,auto,NaN
832,42688.0,5.0,"['Type Log ', 'Run ', 'Interval ', 'Max. BHT '...",NaN,auto,NaN
...,...,...,...,...,...,...
1048570,NaN,NaN,NaN,NaN,NaN,NaN
1048571,NaN,NaN,NaN,NaN,NaN,NaN
1048572,NaN,NaN,NaN,NaN,NaN,NaN
1048573,NaN,NaN,NaN,NaN,NaN,NaN
1048574,NaN,NaN,NaN,NaN,NaN,NaN

In [66]:
data.loc[data['Columns_x'] != data['Columns_x']]

,DocID,TableNum,Columns_x,Class,TagMethod,Columns_y
4919,NaN,NaN,NaN,NaN,NaN,NaN
4920,NaN,NaN,NaN,NaN,NaN,NaN
4921,NaN,NaN,NaN,NaN,NaN,NaN
4922,NaN,NaN,NaN,NaN,NaN,NaN
4923,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...
1056536,99683.0,5.0,NaN,NaN,NaN,"['BIM ', 'Block ', 'Sub-blocks ', 'Clon ', 'e ..."
1056537,99683.0,6.0,NaN,NaN,NaN,"['Hole Id ', 'East MGA94 ', 'North MGA94 ', 'A..."
1056538,99683.0,7.0,NaN,NaN,NaN,"['O ', 'ECP001 ECR0003 ', 'O ', 'ANP05 ECR0002..."
1056539,99683.0,8.0,NaN,NaN,NaN,"['Hole ID ', 'Easting MGA54 ', 'Northing MGA54..."
1056540,99683.0,9.0,NaN,NaN,NaN,"['O ', 'ECP001 ECR0003 ', 'O ', 'ANP05 ECR0002..."

In [ ]:
while data.shape[0] > 1048576:
    data = data.drop

In [60]:
data[:-10000]

,DocID,TableNum,Columns_x,Class,TagMethod,Columns_y
0,593.0,1.0,"['RIVERS ', 'INNER ', 'by ', 'G. ', 'Rose. ']",0.0,manual,"['RIVERS ', 'INNER ', 'by ', 'G. ', 'Rose. ']"
1,593.0,2.0,"['Adamson, C.L. ', 'Geological Report on the P...",0.0,manual,"['Adamson, C.L. ', 'Geological Report on the P..."
2,1229.0,1.0,"['Bendaaticeras ', 'flindersi ', 'Cephineceras...",0.0,manual,"['Bendaaticeras ', 'flindersi ', 'Cephineceras..."
3,1229.0,2.0,"['Laing, ', 'A.C.M. ', 'and Powr, P.L. 1960. C...",0.0,manual,"['Laing, ', 'A.C.M. ', 'and Powr, P.L. 1960. C..."
4,2646.0,1.0,"['Page ', 'OBJECTIVES ', 'DRILLING ', 'GEOLOGY...",0.0,manual,"['Page ', 'OBJECTIVES ', 'DRILLING ', 'GEOLOGY..."
...,...,...,...,...,...,...
1046536,NaN,NaN,NaN,NaN,NaN,NaN
1046537,NaN,NaN,NaN,NaN,NaN,NaN
1046538,NaN,NaN,NaN,NaN,NaN,NaN
1046539,NaN,NaN,NaN,NaN,NaN,NaN
1046540,NaN,NaN,NaN,NaN,NaN,NaN

In [75]:
data.to_csv('tables_dataset_appended.csv', index=False)